
game_title = [
    "社工: 潜伏者",
    "信息收集: 收集者",
    "社工: 伪装者",
    "入侵: 入侵者黑客",
    "社工: 信息与开户",
    "信息收集: 全球定位",
    "法律: 向网络警察报告"
]
game_info = [
    "打入群聊内部获取关键人信息",
    "收集网站的各个信息安全信息，以辅助之后的黑客攻击",
    "伪装成QQ安全,发送QQ钓鱼网站，盗取一个运营人员的账户密码",
    "通过文件上传漏洞，上传木马病毒并入侵黄色网站后台并彻底摧毁",
    "通过信息收集木马获取系统管理员的信息，并开户管理员，拿到敏感个人信息",
    "IP定位多个管理员，并记录",
    "向网警报告非法网站"
]
game_stroy = [
    "本游戏剧情所有内容均由真实事件改编，本游戏大多数工具全部都是真实的黑客工具。常州籍黑客小常在上网的过程中，一个接待员突然加上了他，向他推销黄色网站，于是常州籍黑客小常开始组织团队开始对该网站进行渗透测试: 小常、小王(你)以及小张，你被分配到了信息收集组，用于辅助进攻",
    "在进行信息收集的时候，发现了这个团伙及其巨大，全国各地用户数量加起来高达 30万以上，这很明显是一个大型的色情犯罪组织，并且各种女大学生在此堕落，你受到了强烈的震撼，更加坚定了你铲除这种不法地带",
    "为了破解网站的登录系统，你决定进行社会工程学，简单来说就是骗，你试图通过钓鱼网站，使得那个黄色网站的一个管理员中招，并且获取他的QQ密码与账户，登录他的QQ获取到重要犯罪证据",
    "通过HackerStack游戏模拟漏洞利用工具，上传远程控制木马病毒到目标管理员的管理员页面，控制管理员的计算机,彻底的摧毁黄色网站",
    "摧毁了黄色网站，那些主要的犯罪分子没有被抓获，他们还会再开新的网站，所以你通过黑客手段，获取他们的信息，通过开户的行为获取到他们的敏感个人信息(现实中违法)",
    "通过全球定位手段，定位到那个人的所在，这个时候，收集好了最后的犯罪证据，保护好你的证据，你将成为网络守护者",
    "你们团队将一起收集好的信息汇总起来，并且提交给了网络警察。黄色网站终于被墙了，你也感谢中国长城防火墙，世界上的罪恶又少了。可是，可是，你忘记影藏自己的踪迹了... ..."
]
